#ifndef DEFINE_VARIABLE
#define DEFINE_VARIABLE
//------------------------------------------------------------
// 整个系统需要使用的一些宏
// 开发作者：王**
// 创建日期：2019-06-01
// 模块版本：1.0
//------------------------------------------------------------
// 修改日期      版本              作者            备注
//------------------------------------------------------------
// 2019-06-01  1.0              王**             原创
//------------------------------------------------------------
#define DEBUG_
#define DB_SERVER_IP ("127.0.0.1")
#define DB_SERVER_PORT ("8888")
#define BEGINTIME_TO_DISTRIBUTE_DATA 1
#define ENDTIME_TO_DISTRIBUTE_DATA 2

#endif
